churuxu/tiny_posix/src/tiny_posix_stm32.c
#include "tiny_posix.h"

#ifdef STM32

#include "system_config.h"

#include <stdarg.h>

#ifndef GPIO_SPEED_FREQ_HIGH
#define GPIO_SPEED_FREQ_HIGH GPIO_SPEED_FAST
#endif

#define FCNTL_CMD_BASE 0x0C00
#define UART_ATTR_GET (FCNTL_CMD_BASE|1)
#define UART_ATTR_SET (FCNTL_CMD_BASE|2)


static int stdio_fds_[3];
static read_func stdin_func_;
static write_func stdout_func_;
static write_func stderr_func_;

void stdio_set_fd(int in, int out, int err){
    stdio_fds_[0] = in;
    stdio_fds_[1] = out;
    stdio_fds_[2] = err;
}

void stdio_set_func(read_func in, write_func out, write_func err){
    stdin_func_ = in;
    stdout_func_ = out;
    stderr_func_ = err;
}

//stdio 输入
int stdio_read(int fd, void* buf, int len){
    if(stdin_func_){
        return stdin_func_(fd, buf, len);
    }
    if(fd == STDIN_FILENO && stdio_fds_[0]){
        return posix_read(stdio_fds_[0], buf, len);
    }
    return -1;
}

//stdio 输出
int stdio_write(int fd, const void* buf, int len){
    if(fd == STDOUT_FILENO){
        if(stdout_func_){
            return stdout_func_(fd, buf, len);
        }
        if(stdio_fds_[1]){
            return posix_write(stdio_fds_[1], buf, len);
        }
    }
    if(fd == STDERR_FILENO){
        if(stderr_func_){
            return stderr_func_(fd, buf, len);
        }
        if(stdio_fds_[1]){
            return posix_write(stdio_fds_[2], buf, len);
        }
    }
    return -1;
}


static void default_clock_init(){
    __HAL_RCC_PWR_CLK_ENABLE();

#ifdef __HAL_RCC_AFIO_CLK_ENABLE    
    __HAL_RCC_AFIO_CLK_ENABLE();
#endif
    __HAL_RCC_GPIOA_CLK_ENABLE();
    __HAL_RCC_GPIOB_CLK_ENABLE();   
    __HAL_RCC_GPIOC_CLK_ENABLE();
#ifdef GPIOD
    __HAL_RCC_GPIOD_CLK_ENABLE();
#endif
#ifdef GPIOE
    __HAL_RCC_GPIOE_CLK_ENABLE();
#endif
#ifdef GPIOF
    __HAL_RCC_GPIOF_CLK_ENABLE();
#endif
#ifdef GPIOG
    __HAL_RCC_GPIOG_CLK_ENABLE();
#endif
}



#ifdef __GNUC__
__attribute__((constructor))
#endif
void tiny_posix_init(){    
    HAL_Init();
      
    SystemClock_Config();

    default_clock_init();

    HAL_SYSTICK_Config(HAL_RCC_GetHCLKFreq()/1000);

    HAL_SYSTICK_CLKSourceConfig(SYSTICK_CLKSOURCE_HCLK);

    HAL_NVIC_SetPriority(SysTick_IRQn, 0, 0);

    System_Config();    
}

//===============  fifo ================

typedef struct fifo{
	uint8_t* begin;  //buffer开头
	uint8_t* end;	//buffer结尾
	uint8_t* posread;  //读位置
	uint8_t* poswrite;	 //写位置	
}fifo;


static void fifo_init(fifo* result, void* buf, size_t sz){
	result->begin = (uint8_t*)buf;
	result->end = (uint8_t*)buf + sz;	
	result->poswrite = result->begin;
	result->posread = result->begin;
}
/*
static int fifo_is_full(fifo* f){
    uint8_t* nextpos = f->poswrite; 
    if(nextpos == f->end){
        nextpos = f->begin;
    }else{
        nextpos ++;
    }
    return nextpos == f->posread;
}*/

static int fifo_is_empty(fifo* f){
    return f->posread == f->poswrite;
}
static int fifo_push(fifo* f, uint8_t ch){
    uint8_t* posread;
    uint8_t* nextpos; 
    posread = f->posread; 
    nextpos = f->poswrite;
    if(nextpos == f->end){
        nextpos = f->begin;
    }else{
        nextpos ++;
    }
    if(nextpos == posread){ //下一个字节 = 读位置，说明已满
        return -1;
    }
    *f->poswrite = ch;
    f->poswrite = nextpos;
    return 0;
}

static int fifo_pop(fifo* f, uint8_t* pch){
    uint8_t* poswrite; 
    poswrite = f->poswrite;
    if(f->posread == poswrite){ //当前位置 = 写位置，说明已空
        return -1;
    }        
    *pch = *f->posread;
    if(f->posread == f->end){
        f->posread = f->begin;
    }else{
        f->posread ++;
    }  
    return 0;
}

static int fifo_write(fifo* f, const uint8_t* buf, int buflen){		
    uint8_t* posread;     
    uint8_t* nextpos; 
    int i;       
	if(!buf || buflen<=0)return 0;	
    posread = f->posread;    
    for(i=0; i<buflen; i++){
        nextpos = f->poswrite;
        if(nextpos == f->end){
            nextpos = f->begin;
        }else{
            nextpos ++;
        }        
        if(nextpos == posread){ //下一个字节 = 读位置，说明已满
            break;
        }
        *f->poswrite = *buf;
        f->poswrite = nextpos;
        buf ++;        
    }
	return i;
}


static int fifo_read(fifo* f, uint8_t* buf, int buflen){		
    uint8_t* poswrite;    
    int i;       
	if(!buf || buflen<=0)return 0;	
    poswrite = f->poswrite;    
    for(i=0; i<buflen; i++){
        if(f->posread == poswrite){ //当前位置 = 写位置，说明已空
            break;
        }        
        *buf = *f->posread;
        if(f->posread == f->end){
            f->posread = f->begin;
        }else{
            f->posread ++;
        } 
        buf ++;      
    }
	return i;
}


//=============== gpio =================

GPIO_TypeDef* gpio_ports_[] = {
    GPIOA,
    GPIOB,
#ifdef GPIOC    
    GPIOC,
#endif    
#ifdef GPIOD
    GPIOD,
#endif
#ifdef GPIOE
    GPIOE,
#endif
#ifdef GPIOF
    GPIOF,
#endif
#ifdef GPIOG
    GPIOG,
#endif
#ifdef GPIOH
    GPIOH,
#endif
#ifdef GPIOI
    GPIOI,
#endif
};

//gpio中断回调函数
static irq_handler gpio_irqs_[16];
//gpio中断的pin
static uint16_t gpio_irq_pins_;

//中断处理函数，中断中调用HAL库，HAL库回调此函数
void HAL_GPIO_EXTI_Callback(uint16_t pin){
    uint8_t index = 0;
    gpio_irq_pins_ |= pin;
    if( pin > 0 ) {
        while( pin != 0x01 ){
            pin = pin >> 1;
            index++;
        }
    }
    if(gpio_irqs_[index]){
        gpio_irqs_[index]();
    }
}


int gpio_init_ex(int fd, int mode, int pull, int af){
    GPIO_InitTypeDef GPIO_InitStruct;
    GPIO_InitStruct.Pin = GPIO_FD_GET_PIN(fd);
    GPIO_InitStruct.Mode = mode;
    GPIO_InitStruct.Pull = pull;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
#ifdef IS_GPIO_AF 
    GPIO_InitStruct.Alternate = af;
#endif
    HAL_GPIO_Init(GPIO_FD_GET_PORT(fd), &GPIO_InitStruct);   
    gpio_reset(fd);
    switch(mode){
        case GPIO_MODE_IT_RISING:
        case GPIO_MODE_IT_FALLING:
        case GPIO_MODE_IT_RISING_FALLING:
            gpio_set_irq(fd, NULL);
        default:
            break;
    }
    
