churuxu/tiny_posix/src/tiny_posix_stm32.c
    return 0;    
}


int gpio_init(int fd, int mode, int pull){    
    return gpio_init_ex(fd, mode, pull, 0);    
}

void gpio_set_irq(int fd, irq_handler func){
    IRQn_Type IRQnb = EXTI0_IRQn;
    uint32_t priority = 0;
    uint16_t pin = GPIO_FD_GET_PIN(fd);
    int index = 0;
    switch(pin) {
        case GPIO_PIN_0:  index = 0;  IRQnb = EXTI0_IRQn;	break;
        case GPIO_PIN_1:  index = 1;  IRQnb = EXTI1_IRQn;	break;
        case GPIO_PIN_2:  index = 2;  IRQnb = EXTI2_IRQn;	break;
        case GPIO_PIN_3:  index = 3;  IRQnb = EXTI3_IRQn;	break;
        case GPIO_PIN_4:  index = 4;  IRQnb = EXTI4_IRQn;	break;
        case GPIO_PIN_5:  index = 5;  IRQnb = EXTI9_5_IRQn; break;
        case GPIO_PIN_6:  index = 6;  IRQnb = EXTI9_5_IRQn;	break;
        case GPIO_PIN_7:  index = 7;  IRQnb = EXTI9_5_IRQn;	break;
        case GPIO_PIN_8:  index = 8;  IRQnb = EXTI9_5_IRQn;	break;
        case GPIO_PIN_9:  index = 9;  IRQnb = EXTI9_5_IRQn; break;
        case GPIO_PIN_10: index = 10; IRQnb = EXTI15_10_IRQn; break;
        case GPIO_PIN_11: index = 11; IRQnb = EXTI15_10_IRQn; break;
        case GPIO_PIN_12: index = 12; IRQnb = EXTI15_10_IRQn; break;
        case GPIO_PIN_13: index = 13; IRQnb = EXTI15_10_IRQn; break;
        case GPIO_PIN_14: index = 14; IRQnb = EXTI15_10_IRQn; break;
        case GPIO_PIN_15: index = 15; IRQnb = EXTI15_10_IRQn; break;
        default:return;
    }
    gpio_irqs_[index] = func;

    HAL_NVIC_SetPriority(IRQnb, priority, 0);
    HAL_NVIC_EnableIRQ(IRQnb);    
}



int gpio_fcntl(int fd, int key, void* value){
    return -1;
}

int gpio_poll(int fd, int event){
    int ev = 0;
    uint16_t pin;
    if(event & POLLOUT){
        ev |= POLLOUT;
    } 
    if((event & POLLPRI) || (event & POLLIN)){
        pin = GPIO_FD_GET_PIN(fd);
        if(gpio_irq_pins_ & pin){
            gpio_irq_pins_ &= ~pin;
            ev |= event;            
        }
    }
    return ev;
}

int gpio_read(int fd, void* buf, int len){
    uint8_t* pbuf = (uint8_t*)buf;
    int val = gpio_status(fd);
    *pbuf = val?1:0;
    return 1;
}
int gpio_write(int fd, const void* buf, int len){
    uint8_t* pbuf = (uint8_t*)buf;
    if(*pbuf){
        gpio_set(fd);
    }else{
        gpio_reset(fd);
    }    
    return 1;
}



//======================== uart ========================

static USART_TypeDef* uarts_[] = {
    USART1,
    USART2,
#ifdef USART3   
    USART3,
#endif     
#ifdef UART4
    UART4,
#endif 
#ifdef UART5
    UART5,
#endif     
};


#define UART_FIFO_BUFSIZE 512

typedef struct UART_Object{
    UART_HandleTypeDef handle;
    int flags; //fd选项
    fifo txfifo; //发送队列
    fifo rxfifo; //接收队列
    uint8_t* buf;    
    uint8_t rxch;
    uint8_t txch;
}UART_Object;

static UART_Object uart_objs_[sizeof(uarts_)/sizeof(void*)];


//发送中断
void HAL_UART_TxCpltCallback(UART_HandleTypeDef* handle){
    UART_Object* obj = (UART_Object*)handle;
    int ret = fifo_pop(&obj->txfifo, &obj->txch);
    if(ret == 0){ //有数据要发
        HAL_UART_Transmit_IT(handle, &obj->txch, 1);
    }
}

//接收中断
void HAL_UART_RxCpltCallback(UART_HandleTypeDef *handle){
    UART_Object* obj = (UART_Object*)handle;
    fifo_push(&obj->rxfifo, obj->rxch);
    HAL_UART_Receive_IT(handle, &obj->rxch, 1);
}

//出错时恢复接收
void HAL_UART_ErrorCallback( UART_HandleTypeDef *handle ){
    UART_Object* obj = (UART_Object*)handle;
    HAL_UART_Receive_IT(handle, &obj->rxch, 1);
}


static UART_HandleTypeDef* uart_get_handle(int fd){
    int index = UART_FD_GET_INDEX(fd);    
    return &(uart_objs_[index].handle);
}

static UART_Object* uart_get_object(int fd){
    int index = UART_FD_GET_INDEX(fd);    
    return &(uart_objs_[index]);
}

static int uart_get_gpio_af(int index){
#ifdef GPIO_AF7_USART1
    if(index == 0)return GPIO_AF7_USART1;
#endif
#ifdef GPIO_AF7_USART2
    if(index == 1)return GPIO_AF7_USART2;
#endif
#ifdef GPIO_AF7_USART3
    if(index == 2)return GPIO_AF7_USART3;
#endif
#ifdef GPIO_AF8_UART4
    if(index == 3)return GPIO_AF8_UART4;
#endif
#ifdef GPIO_AF8_UART5
    if(index == 4)return GPIO_AF8_UART5;
#endif
    return 0;
}


static int uart_get_attr(int fd){
    int baud;
    int stopbits;
    int parity;
     
    UART_HandleTypeDef* uart = uart_get_handle(fd);
    if(!uart)return 0;

    baud = (uart->Init.BaudRate / 100);
    if(uart->Init.Parity == UART_PARITY_ODD){
        parity = PARENB | PARODD;
    }else if(uart->Init.Parity == UART_PARITY_EVEN){
        parity = PARENB;
    }else{
        parity = 0;
    }
    stopbits = (uart->Init.StopBits == UART_STOPBITS_2)?CSTOPB:0;

    return baud|CS8|parity|stopbits;
}

int uart_set_attr(int fd, int flags){
    int baud;
    int stopbits;
    int parity;
    int wordlen;
    int index = UART_FD_GET_INDEX(fd);
    UART_HandleTypeDef* uart = uart_get_handle(fd);   
    if(!uart)return -1;

    baud = ((flags & 0xffff) * 100);
    stopbits = (flags & CSTOPB)? UART_STOPBITS_2 : UART_STOPBITS_1;
    parity = (flags & PARENB)?((flags & PARODD)?UART_PARITY_ODD:UART_PARITY_EVEN):UART_PARITY_NONE;
    wordlen = (flags & PARENB)? UART_WORDLENGTH_9B : UART_WORDLENGTH_8B;

    uart->Instance = uarts_[index];
    uart->Init.BaudRate = baud;
    uart->Init.WordLength = wordlen;
    uart->Init.StopBits = stopbits;
    uart->Init.Parity = parity;
    uart->Init.Mode = UART_MODE_TX_RX;
    uart->Init.HwFlowCtl = UART_HWCONTROL_NONE;
    uart->Init.OverSampling = UART_OVERSAMPLING_16;
    if(HAL_OK != HAL_UART_Init(uart)){
        return -1;
    }
    return 0;
}

static void uart_set_hal(int fd, int clk, int irq){
    int index = UART_FD_GET_INDEX(fd);   

    switch(index){
        case 0: 
            if(clk)__HAL_RCC_USART1_CLK_ENABLE();
            if(irq)HAL_NVIC_EnableIRQ(USART1_IRQn);
            if(irq)HAL_NVIC_SetPriority(USART1_IRQn,0,0);
            break;
        case 1: 
            if(clk)__HAL_RCC_USART2_CLK_ENABLE();
            if(irq)HAL_NVIC_EnableIRQ(USART2_IRQn);
            if(irq)HAL_NVIC_SetPriority(USART2_IRQn,0,0);
            break;
#ifdef USART3        
        case 2: 
            if(clk)__HAL_RCC_USART3_CLK_ENABLE();
            if(irq)HAL_NVIC_EnableIRQ(USART3_IRQn);
            if(irq)HAL_NVIC_SetPriority(USART3_IRQn,0,0);
            break;
#endif
#ifdef UART4        
        case 3: 
            if(clk)__HAL_RCC_UART4_CLK_ENABLE();
            if(irq)HAL_NVIC_EnableIRQ(UART4_IRQn);
            if(irq)HAL_NVIC_SetPriority(UART4_IRQn,0,0);
            break;
#endif
#ifdef UART5 
        case 4: 
            if(clk)__HAL_RCC_UART5_CLK_ENABLE();
            if(irq)HAL_NVIC_EnableIRQ(UART5_IRQn);
            if(irq)HAL_NVIC_SetPriority(UART5_IRQn,0,0);
            break;
#endif        
        default:return;
    }   
}



int uart_init(int fd, int tx, int rx, int flags){    
    int index = UART_FD_GET_INDEX(fd);;
    int af = uart_get_gpio_af(index);

    //开启clock
    uart_set_hal(fd, 1, 0);

    gpio_init_ex(tx, GPIO_MODE_AF_PP, GPIO_NOPULL, af);
#ifdef GPIO_AF7_USART1 //have af
    gpio_init_ex(rx, GPIO_MODE_AF_PP, GPIO_NOPULL, af);
#else
    gpio_init_ex(rx, GPIO_MODE_INPUT, GPIO_NOPULL, af);
#endif 

    return uart_set_attr(fd, flags);    
}


static int uart_set_flags(int fd, int flags){
    UART_Object* obj = (UART_Object*)uart_get_handle(fd);    
    if(flags & O_NONBLOCK){ //非阻塞，分配内存
        if(!obj->buf){
            obj->buf = (uint8_t*)malloc(UART_FIFO_BUFSIZE*2);
            if(!obj->buf){
                errno = ENOMEM;
                return -1;
            }
        }
        fifo_init(&obj->txfifo, obj->buf, UART_FIFO_BUFSIZE);
        fifo_init(&obj->rxfifo, obj->buf + UART_FIFO_BUFSIZE, UART_FIFO_BUFSIZE);

