churuxu/tiny_posix/src/tiny_posix_stm32.c
        //开启中断
        uart_set_hal(fd, 0, 1);

        //开始异步接收
        HAL_UART_Receive_IT(&obj->handle, &obj->rxch, 1);
    }
    obj->flags = flags;
    return 0;
}

int uart_fcntl(int fd, int key, void* value){
    int iv;
    struct termios* attr;
    UART_Object* obj = (UART_Object*)uart_get_handle(fd);
    if(!obj)return -1;
    switch(key){
        case F_GETFL: //获取flags
            *(int*)value = obj->flags;
            return 0;
        case F_SETFL: //设置flags
            iv = (int)(uintptr_t)value;
            return uart_set_flags(fd, iv);
        case UART_ATTR_GET: //获取termios属性
            attr = (struct termios*)value;
            attr->c_cflag = uart_get_attr(fd);
            return 0;
        case UART_ATTR_SET: //设置termios属性
            attr = (struct termios*)value;            
            return uart_set_attr(fd, attr->c_cflag);
        default:
            break;
    }
    return -1;
}


int uart_read(int fd, void* buf, int len){
    int recved = 0;
    int timeout ;
    UART_Object* uart = uart_get_object(fd);
    if(!uart)return -1;
    //非阻塞读取
    if(uart->flags & O_NONBLOCK){
        recved = fifo_read(&uart->rxfifo, buf, len);
        if(recved<=0){
            errno = EWOULDBLOCK;
        }        
        return recved;
    }
    //阻塞读取
    timeout = 3000;
    while(recved < len){
        if(HAL_OK != HAL_UART_Receive(&uart->handle, (uint8_t*)buf + recved, 1, timeout)){
            return recved;
        }
        recved ++;
        timeout = 32;
    }        
    return recved;
}

int uart_write(int fd, const void* buf, int len){
    int writed;
    UART_Object* uart = uart_get_object(fd);
    if(!uart)return -1;
    //非阻塞写入
    if(uart->flags & O_NONBLOCK){
        writed = fifo_write(&uart->txfifo, buf, len);
        if(writed<=0){
            errno = EWOULDBLOCK;
        }
        //触发发送中断
        __HAL_UART_ENABLE_IT((&uart->handle), UART_IT_TC);
        return writed;
    }    
    //阻塞写入
    if(HAL_OK == HAL_UART_Transmit(&uart->handle, (uint8_t*)buf, len, 3000)){
        return len;
    }
    return -1;
}

//检测是否可读写
int uart_poll(int fd, int event){
    int revent = 0;
    UART_Object* uart = uart_get_object(fd);    
    if(uart->flags & O_NONBLOCK){
        if((event & POLLIN) && (!fifo_is_empty(&uart->rxfifo))){            
            revent |= POLLIN;            
        }
        if((event & POLLOUT) && fifo_is_empty(&uart->txfifo)){            
            revent |= POLLOUT;           
        }
    }else{
        revent = event;        
    }    
    return revent;
}

int posix_cfsetispeed(struct termios* attr, speed_t t){
    attr->c_cflag &= 0xffff0000;
    attr->c_cflag |= t;
    return 0;
}
int posix_cfsetospeed(struct termios* attr, speed_t t){
    attr->c_cflag &= 0xffff0000;
    attr->c_cflag |= t;
    return 0;
}
int posix_tcgetattr(int fd, struct termios* attr){
    int flag = uart_get_attr(fd);
    attr->c_cflag = flag;
    return (flag == 0);
}
int posix_tcsetattr(int fd, int act, const struct termios* attr){
    return uart_set_attr(fd, attr->c_cflag);
}
//=====================================================


//======================== spi ========================

static SPI_TypeDef* spis_[] = {
    SPI1,
#ifdef SPI2
    SPI2,
#endif
#ifdef SPI3
    SPI3,
#endif
};


SPI_HandleTypeDef spi_handles_[sizeof(spis_)/sizeof(void*)];

static SPI_HandleTypeDef* spi_get_handle(int fd){
    int index = SPI_FD_GET_INDEX(fd);   
    return &(spi_handles_[index]);
}


static int spi_get_gpio_af(int index){
#ifdef GPIO_AF5_SPI1
    if(index == 0)return GPIO_AF5_SPI1;
#endif
#ifdef GPIO_AF5_SPI2
    if(index == 1)return GPIO_AF5_SPI2;
#endif
#ifdef GPIO_AF5_SPI3
    if(index == 2)return GPIO_AF5_SPI3;
#endif
    return 0;
}

static int spi_set_flags(int fd, int flags){
    int index = SPI_FD_GET_INDEX(fd);
    SPI_HandleTypeDef* spi = spi_get_handle(fd); 

    spi->Instance = spis_[index];
    spi->Init.Mode = SPI_MODE_MASTER;
    spi->Init.Direction = SPI_DIRECTION_2LINES;
    spi->Init.DataSize = SPI_DATASIZE_8BIT;
    spi->Init.CLKPolarity = SPI_POLARITY_LOW;
    spi->Init.CLKPhase = SPI_PHASE_1EDGE;
    spi->Init.NSS = SPI_NSS_SOFT;
    spi->Init.BaudRatePrescaler = SPI_BAUDRATEPRESCALER_8;
    spi->Init.FirstBit = SPI_FIRSTBIT_MSB;
    spi->Init.TIMode = SPI_TIMODE_DISABLE;
    spi->Init.CRCCalculation = SPI_CRCCALCULATION_DISABLE;
    spi->Init.CRCPolynomial = 10;

    if(HAL_OK != HAL_SPI_Init(spi)){
        return -1;
    }
    return 0;    
}

int spi_init(int fd, int clkpin, int misopin, int mosipin){
    int index = SPI_FD_GET_INDEX(fd);
    int af = spi_get_gpio_af(index); 

    //clk enable
    switch(index){
        case 0: __HAL_RCC_SPI1_CLK_ENABLE(); break;
#ifdef SPI2          
        case 1: __HAL_RCC_SPI2_CLK_ENABLE(); break;
#endif
#ifdef SPI3       
        case 2: __HAL_RCC_SPI3_CLK_ENABLE(); break;
#endif  
        default:return -1;
    }

    gpio_init_ex(clkpin,  GPIO_MODE_AF_PP, GPIO_NOPULL, af);
    gpio_init_ex(misopin, GPIO_MODE_INPUT, GPIO_NOPULL, af);
    gpio_init_ex(mosipin, GPIO_MODE_AF_PP, GPIO_NOPULL, af);        

    return spi_set_flags(fd, 0);
}


int spi_io(int fd, const void* out, void* in, int len){
    SPI_HandleTypeDef* spi = spi_get_handle(fd); 
    if(!spi)return -1;
    if(HAL_OK == HAL_SPI_TransmitReceive(spi, (uint8_t*)out, (uint8_t*)in, len, 640)){
        return len;
    }
    return -1;   
}

int spi_read(int fd, void* buf, int len){
    int recved = 0;
    int timeout ;
    SPI_HandleTypeDef* spi = spi_get_handle(fd); 
    if(!spi)return -1;
    timeout = 320;
    while(recved < len){
        if(HAL_OK != HAL_SPI_Receive(spi, (uint8_t*)buf + recved, 1, timeout)){
            return recved;
        }
        recved ++;
        timeout = 16;
    }        
    return recved;    
}

int spi_write(int fd, const void* buf, int len){
    SPI_HandleTypeDef* spi = spi_get_handle(fd); 
    if(!spi)return -1; 
    if(HAL_OK == HAL_SPI_Transmit(spi, (uint8_t*)buf, len, 320)){
        return len;
    }
    return -1;
}

//======================== I2C =============================

static I2C_TypeDef* i2cs_[] = {
    I2C1,
#ifdef I2C2
    I2C2,
#endif
};

