churuxu/tiny_posix/src/tiny_posix_stm32.c
static I2C_HandleTypeDef i2c_handles_[sizeof(i2cs_)/sizeof(void*)];

//对端地址
static uint16_t i2c_peers_[sizeof(i2cs_)/sizeof(void*)]; 
//读写地址
static uint16_t i2c_memaddr_[sizeof(i2cs_)/sizeof(void*)];

static I2C_HandleTypeDef* i2c_get_handle(int fd){
    int index = I2C_FD_GET_INDEX(fd);    
    return &(i2c_handles_[index]);
}


static int i2c_get_gpio_af(int index){
#ifdef GPIO_AF4_I2C1
    if(index == 0)return GPIO_AF4_I2C1;
#endif
#ifdef GPIO_AF4_I2C2
    if(index == 1)return GPIO_AF4_I2C2;
#endif
    return 0;
}

int i2c_set_peer(int fd, int addr){
    int index = I2C_FD_GET_INDEX(fd);   
    i2c_peers_[index] = (uint16_t)addr;
    return 0;
}

int i2c_set_offset(int fd, int off){
    int index = I2C_FD_GET_INDEX(fd);   
    i2c_memaddr_[index] = (uint16_t)off;
    return 0;
}

int i2c_set_local(int fd, int addr){
    int index = I2C_FD_GET_INDEX(fd);   
    I2C_HandleTypeDef* i2c = i2c_get_handle(fd); 

    i2c->Instance             = i2cs_[index];  
    i2c->Init.AddressingMode  = I2C_ADDRESSINGMODE_7BIT;
    i2c->Init.ClockSpeed      = 400000;
    i2c->Init.DualAddressMode = I2C_DUALADDRESS_DISABLE;
    i2c->Init.DutyCycle       = I2C_DUTYCYCLE_2;
    i2c->Init.GeneralCallMode = I2C_GENERALCALL_DISABLE;
    i2c->Init.NoStretchMode   = I2C_NOSTRETCH_DISABLE;
    i2c->Init.OwnAddress1     = (uint8_t)(addr & 0xff);
    i2c->Init.OwnAddress2     = 0xff;

    if(HAL_OK != HAL_I2C_Init(i2c)){
        return -1;
    }
    return 0;    
}


//初始化i2c（主机）
int i2c_init(int fd, int sclpin, int sdapin, int flags, int peeraddr){
    int index = I2C_FD_GET_INDEX(fd);   
    int af = i2c_get_gpio_af(index); 

    //clk enable
    switch(index){
        case 0: __HAL_RCC_I2C1_CLK_ENABLE(); break;
#ifdef I2C2
        case 1: __HAL_RCC_I2C2_CLK_ENABLE(); break;
#endif
        default:return -1;
    }

    gpio_init_ex(sclpin, GPIO_MODE_AF_OD, GPIO_PULLUP, af);
    gpio_init_ex(sdapin, GPIO_MODE_AF_OD, GPIO_PULLUP, af);

    i2c_set_peer(fd, peeraddr);
    return i2c_set_local(fd, flags);
}

int i2c_test(int fd){
    uint16_t peer;
    int index = I2C_FD_GET_INDEX(fd);   
    int timeout = 1000;
    I2C_HandleTypeDef* i2c = i2c_get_handle(fd); 
    if(!i2c)return -1;
    peer = i2c_peers_[index];
    if(HAL_OK == HAL_I2C_IsDeviceReady(i2c, peer, 1, timeout)){
        return 0;
    }   
    return -2; 
}

//read/write 函数
int i2c_read(int fd, void* buf, int len){
    uint16_t peer;
    uint16_t mem;
    uint16_t memsz = 1;
    int index = I2C_FD_GET_INDEX(fd);   
    int recved = 0;
    int timeout ;
    I2C_HandleTypeDef* i2c = i2c_get_handle(fd); 
    if(!i2c)return -1;
    timeout = 5000;
    peer = i2c_peers_[index];
    mem = i2c_memaddr_[index];
    if(HAL_OK == HAL_I2C_Mem_Read(i2c, peer, mem, memsz, (uint8_t*)buf, len, timeout)){
        recved = len;
    }    
    /*
    while(recved < len){
        if(HAL_OK != HAL_I2C_Master_Receive(i2c, peer, (uint8_t*)buf + recved, 1, timeout)){
            return recved;
        }
        recved ++;
        timeout = 32;
    } */       
    return recved;
}

int i2c_write(int fd, const void* buf, int len){
    uint16_t peer;
    uint16_t mem;
    uint16_t memsz = 1;    
    int timeout ;
    int index = I2C_FD_GET_INDEX(fd);   
    I2C_HandleTypeDef* i2c = i2c_get_handle(fd); 
    if(!i2c)return -1; 
    timeout = 5000;
    peer = i2c_peers_[index];
    mem = i2c_memaddr_[index];
    if(HAL_OK == HAL_I2C_Mem_Write(i2c, peer, mem, memsz, (uint8_t*)buf, len, timeout)){
        return len;
    }    
    /*
    if(HAL_OK == HAL_I2C_Master_Transmit(i2c, peer, (uint8_t*)buf, len, 2000)){
        return len;
    }*/
    return -1;
}

//===================== rom ===================

int rom_read(int fd, void* buf, int len){
    void* addr = ROM_FD_GET_ADDRESS(fd);
    memcpy(buf, addr, len);
    return len;
}


int rom_write(int fd, const void* buf, int buflen){
    int ret = -1;   
#if defined(FLASH_PAGE_SIZE) && defined(FLASH_TYPEERASE_PAGES)
    FLASH_EraseInitTypeDef pEraseInit;
    uint32_t error = 0;
    uint64_t* ptr = (uint64_t*)buf;
    size_t remainlen = buflen;
    HAL_StatusTypeDef state;
    uint64_t last = (uint64_t)(-1);
    
    uint32_t addr = (uint32_t)(uintptr_t)ROM_FD_GET_ADDRESS(fd);
    if(!addr || buflen>FLASH_PAGE_SIZE){
        errno = EINVAL;
        return -1;        
    }    

    HAL_FLASH_Unlock();

    pEraseInit.PageAddress = addr;
    pEraseInit.NbPages = 1;
    pEraseInit.TypeErase = FLASH_TYPEERASE_PAGES;
    state = HAL_FLASHEx_Erase(&pEraseInit, &error);
    if(state != HAL_OK){        
        errno = EFAULT;
        goto finish;
    }

    while(remainlen >= 8){
        state = HAL_FLASH_Program(FLASH_TYPEPROGRAM_DOUBLEWORD, addr, *ptr);
        if (state != HAL_OK){
            errno = EIO;
            goto finish;
        }     
        ptr += 1;
        addr += 8;
        remainlen -= 8;
    }

    if(remainlen>0 && remainlen<8){
        memcpy(&last, ptr, remainlen);        
        state = HAL_FLASH_Program(FLASH_TYPEPROGRAM_DOUBLEWORD, addr, last);
        if (state != HAL_OK){
            errno = EIO;
            goto finish;
        }         
    }

    ret = buflen;
finish:
    HAL_FLASH_Lock();    
#endif
    return ret;    
}

//===================== fsmc ===================


void* fsmc_init(int* pins, int count, uint32_t bank){
#ifdef GPIO_AF12_FSMC
    static SRAM_HandleTypeDef fsmc;
    FSMC_NORSRAM_TimingTypeDef Timing;
    int i;
    __HAL_RCC_FSMC_CLK_ENABLE();

    gpio_init(pins[0], GPIO_MODE_OUTPUT_PP, GPIO_PULLUP);
    for(i=1;i<count;i++){
        gpio_init_ex(pins[i], GPIO_MODE_AF_PP, GPIO_PULLUP, GPIO_AF12_FSMC);
    }

    fsmc.Instance = FSMC_NORSRAM_DEVICE;
    fsmc.Extended = FSMC_NORSRAM_EXTENDED_DEVICE;

    fsmc.Init.NSBank = bank;
    fsmc.Init.DataAddressMux = FSMC_DATA_ADDRESS_MUX_DISABLE;
    fsmc.Init.MemoryType = FSMC_MEMORY_TYPE_SRAM;
    fsmc.Init.MemoryDataWidth = FSMC_NORSRAM_MEM_BUS_WIDTH_16;
    fsmc.Init.BurstAccessMode = FSMC_BURST_ACCESS_MODE_DISABLE;
    fsmc.Init.WaitSignalPolarity = FSMC_WAIT_SIGNAL_POLARITY_LOW;
    fsmc.Init.WrapMode = FSMC_WRAP_MODE_DISABLE;
    fsmc.Init.WaitSignalActive = FSMC_WAIT_TIMING_BEFORE_WS;
    fsmc.Init.WriteOperation = FSMC_WRITE_OPERATION_ENABLE;
    fsmc.Init.WaitSignal = FSMC_WAIT_SIGNAL_DISABLE;
    fsmc.Init.ExtendedMode = FSMC_EXTENDED_MODE_DISABLE;
    fsmc.Init.AsynchronousWait = FSMC_ASYNCHRONOUS_WAIT_DISABLE;
    fsmc.Init.WriteBurst = FSMC_WRITE_BURST_DISABLE;
    //fsmc.Init.PageSize = 0;
     /* Timing */
    Timing.AddressSetupTime = 5;
    Timing.AddressHoldTime = 15;
    Timing.DataSetupTime = 8;
    Timing.BusTurnAroundDuration = 1;
    Timing.CLKDivision = 16;
    Timing.DataLatency = 17;
    Timing.AccessMode = FSMC_ACCESS_MODE_A;    
  
    if (HAL_SRAM_Init(&fsmc, &Timing, NULL) != HAL_OK)
    {
        return NULL;
    }
    HAL_Delay(10);
    if(bank == FSMC_NORSRAM_BANK1){
        return (void*)(uintptr_t)0x60000000;
    }
    if(bank == FSMC_NORSRAM_BANK2){
        return (void*)(uintptr_t)0x64000000;
    }
    if(bank == FSMC_NORSRAM_BANK3){
        return (void*)(uintptr_t)0x68000000;
    }
    if(bank == FSMC_NORSRAM_BANK4){
        return (void*)(uintptr_t)0x6C000000;
    } 
#endif
    return NULL;
}



//===================== lcd ===================
#define MAX_LCD_COUNT 1

static LCD_DrvTypeDef* lcd_drvs_[MAX_LCD_COUNT];
static uint16_t lcd_ids_[MAX_LCD_COUNT];
static uint8_t lcd_state_[MAX_LCD_COUNT];

int lcd_init(int fd, LCD_DrvTypeDef* driver, uint16_t lcdid){
    uint16_t readedid;
    int index = LCD_FD_GET_INDEX(fd);
    if(index >= MAX_LCD_COUNT)return -1;
    lcd_drvs_[index] = driver;
    lcd_ids_[index] = lcdid;

    driver->Init();
    readedid = driver->ReadID();
    if(lcdid && lcdid != readedid){
        return -1;
    }
    driver->DisplayOn();
    lcd_state_[index] = 1;
    return 0;
}

//turn on/off
int lcd_display(int fd, int on){
    return 0;
}

int lcd_get_width(int fd);
int lcd_get_height(int fd);

int lcd_draw(int fd, int x, int y, int w, int h, void* rgbdata);




//======================= raw disk =============================

typedef struct disk_info{    
    unsigned int total_size;
    unsigned int block_count;
    unsigned int block_size;
    unsigned int sector_count;
    unsigned int sector_size;
    unsigned int rw_pos;
    uint16_t fact; //block_size = fact * sector_size
    uint8_t inited;
    uint8_t rev;
}disk_info;

#ifndef DISK_BUFSIZE
#define DISK_BUFSIZE 4096
#endif

