churuxu/tiny_posix/src/tiny_posix_stm32.c
#define MAX_DISK_COUNT 4

static Diskio_drvTypeDef* disk_drvs_[MAX_DISK_COUNT];
static disk_info disk_info_[MAX_DISK_COUNT];




int disk_init(int fd, Diskio_drvTypeDef* driver){    
    int index = DISK_FD_GET_INDEX(fd);    
    if(index >= MAX_DISK_COUNT)return -1; 
    disk_drvs_[index] = driver;
    if(driver->disk_initialize(index)){
        return -1;
    }
    if(driver->disk_ioctl(index, GET_SECTOR_COUNT, &disk_info_[index].sector_count)){
        return -1;
    }
    if(driver->disk_ioctl(index, GET_SECTOR_SIZE, &disk_info_[index].sector_size)){
        return -1;
    }
    if(driver->disk_ioctl(index, GET_BLOCK_SIZE, &disk_info_[index].block_size)){
        return -1;
    }  
    if(disk_info_[index].block_size > DISK_BUFSIZE){
        return -1;  
    }
    disk_info_[index].fact = disk_info_[index].block_size / disk_info_[index].sector_size;
    if(!disk_info_[index].fact){
        return -1;  
    }
    disk_info_[index].inited = 1;
    disk_info_[index].total_size = disk_info_[index].sector_size * disk_info_[index].sector_count;
    disk_info_[index].block_count = disk_info_[index].total_size / disk_info_[index].block_size;
    
    return 0;  
}

int disk_lseek(int fd, int offset, int how){
    int pos;
    int index = DISK_FD_GET_INDEX(fd);
    if(index >= MAX_DISK_COUNT)return -1; 
    if(!disk_info_[index].inited)return -1;
    if(how == SEEK_END){
        pos = disk_info_[index].total_size;
    }else if(how == SEEK_CUR){
        pos = disk_info_[index].rw_pos + offset;
    }else{
        pos = offset;
    }
    if(pos<0||pos>disk_info_[index].total_size)goto error;
    if(offset % disk_info_[index].block_size)goto error;
    disk_info_[index].rw_pos = pos;
    return pos;
error: 
    disk_info_[index].rw_pos = disk_info_[index].total_size;
    return -1;
}


typedef struct disk_io_param{
    unsigned int sector_count; //要读写的块个数
    unsigned int sector_index; //要读写的块索引  
    unsigned int offset; //读到buffer 不是从0开始
    unsigned int io_len; //读到buffer 不是全部    
    unsigned int remain_len; //剩余长度
    int need_buffer; //是否需要buffer
}disk_io_param;

//计算读写扇区位置
static void disk_calc_io_param(unsigned int secsize, unsigned int secount, unsigned int pos, unsigned int len, disk_io_param* param){
    unsigned int m, n, lm, ln, total; 
    total = secsize * secount;
    if((pos + len) > total){
        len = total - pos;
    }
    if(secsize == 1){ //块大小=1，随便读写
        param->sector_count = len;
        param->sector_index = pos;
        param->offset = 0;
        param->io_len = len; 
        param->remain_len = 0;
        param->need_buffer = 0; 
        return;        
    }
    m = pos % secsize;
    n = pos / secsize;
    if(m){ //非基准点
        param->need_buffer = 1;
        param->sector_count = 1;
        param->sector_index = n;
        param->offset = m;
        param->io_len = secsize - m;
        if(param->io_len > len){
            param->remain_len = 0;
            param->io_len = len;
        }else{
            param->remain_len = len - param->io_len;
        }
    }else{ //基准点
        lm = len % secsize;
        ln = len / secsize;
        if(!lm){ //刚好倍数大小
            param->sector_count = ln;
            param->sector_index = n;
            param->offset = 0;
            param->io_len = len; 
            param->remain_len = 0;
            param->need_buffer = 0;           
        }else{ //有多余
            if(ln){ //不是最后一块
                param->sector_count = ln;
                param->sector_index = n;
                param->offset = 0;
                param->io_len = ln * secsize; 
                param->remain_len = len - param->io_len;
                param->need_buffer = 0;           
            }else{ //最后一块
                param->sector_count = 1;
                param->sector_index = n;
                param->offset = 0;
                param->io_len = len; 
                param->remain_len = 0;
                param->need_buffer = 1; 
            }
        }
    }
}


int disk_read(int fd, void* buf, int len){
    int pos;
    int readed = 0;   
    int ret;
    disk_io_param param;
    uint8_t* tempbuf = NULL;
    int index = DISK_FD_GET_INDEX(fd);
    if(index >= MAX_DISK_COUNT)return -1; 
    if(!disk_info_[index].inited)return -1;

    pos = disk_info_[index].rw_pos;
    param.remain_len = len;
    while(param.remain_len){
        disk_calc_io_param(disk_info_[index].sector_size, disk_info_[index].sector_count, pos, param.remain_len, &param);
        //printf("    read sec:%d\tnum:%d\tpos:%d\toff:%d\tlen:%d\n", param.sector_index, param.sector_count, pos, param.offset, param.io_len);
        if(param.need_buffer){ //需要临时buffer
            if(!tempbuf)tempbuf = (uint8_t*)malloc(disk_info_[index].sector_size);
            if(!tempbuf)goto error;            
        }else{
            tempbuf = (uint8_t*)buf + readed;
        }
        ret = disk_drvs_[index]->disk_read(index, tempbuf, param.sector_index, param.sector_count);
        if(ret)goto error;

        if(param.need_buffer){ //如果读到了临时buffer
            memcpy((uint8_t*)buf + readed, tempbuf + param.offset, param.io_len);         
        }

        readed += param.io_len;
        pos += param.io_len;
        disk_info_[index].rw_pos = pos;
    }

    goto finish;
error:
    readed = -1;
finish:    
    if(tempbuf)free(tempbuf);    
    return readed;
}

int disk_write(int fd, const void* buf, int len){
    int pos;
    int writed = 0;   
    int ret;
    int secindex, seccount;
    disk_io_param param;
    uint8_t* tempbuf = NULL;
    int index = DISK_FD_GET_INDEX(fd);
    if(index >= MAX_DISK_COUNT)return -1; 
    if(!disk_info_[index].inited)return -1;

    pos = disk_info_[index].rw_pos;
    param.remain_len = len;
    while(param.remain_len){
        disk_calc_io_param(disk_info_[index].block_size, disk_info_[index].block_count, pos, param.remain_len, &param);
        //printf("    read sec:%d\tnum:%d\tpos:%d\toff:%d\tlen:%d\n", param.sector_index, param.sector_count, pos, param.offset, param.io_len);
        secindex = param.sector_index * disk_info_[index].fact;
        seccount = param.sector_count * disk_info_[index].fact;
        if(param.need_buffer){ //需要临时buffer
            if(!tempbuf)tempbuf = (uint8_t*)malloc(disk_info_[index].block_size);
            if(!tempbuf)goto error; 

            //先读到临时buffer，以保留原有数据
            ret = disk_drvs_[index]->disk_read(index, tempbuf, secindex, seccount);                
            if(ret)goto error;

            memcpy(tempbuf + param.offset, buf, param.io_len);

        }else{
            tempbuf = (uint8_t*)buf + writed;
        }
        ret = disk_drvs_[index]->disk_write(index, tempbuf, secindex, seccount);
        if(ret)goto error;
        
        writed += param.io_len;
        pos += param.io_len;
        disk_info_[index].rw_pos = pos;
    }

    goto finish;
error:
    writed = -1;
finish:    
    if(tempbuf)free(tempbuf);    
    return writed;    
}


//======================== posix api =============================


typedef struct file_ops{
    read_func rd;
    write_func wr;    
    fcntl_func fctl;
    poll_func pl;
}file_ops;

static file_ops file_ops_[] = {
    {stdio_read, stdio_write, NULL, NULL},
    {gpio_read,  gpio_write,  gpio_fcntl, gpio_poll},
    {uart_read,  uart_write,  uart_fcntl, uart_poll}, 
    {spi_read,   spi_write,   NULL, NULL}, 
    {i2c_read,   i2c_write,   NULL, NULL}, 
    {rom_read,   rom_write,  NULL, NULL}, 
};


ssize_t posix_read(int fd, void* buf, size_t sz){
    int type = FD_GET_TYPE(fd);
    read_func func = file_ops_[type].rd;
    if(func)return func(fd, buf, sz);
    return -1;
}

