churuxu/tiny_posix/src/tiny_posix_stm32.c
ssize_t posix_write(int fd, const void* buf, size_t sz){
    int type = FD_GET_TYPE(fd);
    write_func func = file_ops_[type].wr;
    if(func)return func(fd, buf, sz);
    return -1;
}


int posix_poll(struct pollfd* fds, unsigned int nfds, int timeout){
    unsigned int i;
    int revent,type;
    int ret = 0;
    struct pollfd* pfd;
    poll_func func;
    uint32_t start = HAL_GetTick();
    do{
        for(i = 0; i<nfds; i++){
            pfd = &fds[i];
            type = FD_GET_TYPE(pfd->fd);
            func = file_ops_[type].pl;
            if(func){
                revent = func(pfd->fd, pfd->events);
            }else{
                revent = pfd->events;
            }  
            pfd->revents = (short)revent;
            if(revent)ret ++;
        }
        if(ret)break;
        //TODO 进入睡眠模式
    }while((HAL_GetTick() - start) < timeout);
    
    return ret;
}

int posix_open(const char* pathname, int flags, ...){
    int fd = System_Open(pathname, flags);
    if(fd>=0)return fd;
    return -1;
}

int posix_close(int fd){
    return 0;
}


int posix_fcntl(int fd, int cmd, ...){
    int type = FD_GET_TYPE(fd);
    va_list ap;
    void* value;
    int ret = -1;
    fcntl_func func = file_ops_[type].fctl;
    if(func){
        va_start(ap, cmd);
        value = va_arg(ap, void*);
        ret = func(fd, cmd, value);
        va_end(ap);
    }    
    return ret;
}




unsigned int posix_sleep(unsigned int seconds){
    HAL_Delay(seconds * 1000);
    return 0;
}
unsigned int posix_usleep(unsigned int micro_seconds){
   //HAL_Delay(micro_seconds / 1000);
    int ms = micro_seconds / 1000;
    if(ms){
        HAL_Delay(ms);
        return 0;
    }else{
        while(micro_seconds>0){
            micro_seconds -- ;
        }
    }
    return micro_seconds;
}

clock_t posix_clock(){
    return HAL_GetTick();
}


int posix_getaddrinfo(const char* host, const char* port, const struct addrinfo* hint, struct addrinfo** ai){
    return -1;
}

void posix_freeaddrinfo(struct addrinfo* ai){
    
}





//============= 各系统中断 ===============

void SysTick_Handler(){ 
    HAL_IncTick();
    HAL_SYSTICK_IRQHandler(); 
}
void EXTI0_IRQHandler(){
    HAL_GPIO_EXTI_IRQHandler(GPIO_PIN_0);
}
void EXTI1_IRQHandler(){
    HAL_GPIO_EXTI_IRQHandler(GPIO_PIN_1);
}
void EXTI2_IRQHandler(){
    HAL_GPIO_EXTI_IRQHandler(GPIO_PIN_2);
}
void EXTI3_IRQHandler(){
    HAL_GPIO_EXTI_IRQHandler(GPIO_PIN_3);
}
void EXTI4_IRQHandler(){
    HAL_GPIO_EXTI_IRQHandler(GPIO_PIN_4);
}
void EXTI9_5_IRQHandler(){
    HAL_GPIO_EXTI_IRQHandler(GPIO_PIN_5);
    HAL_GPIO_EXTI_IRQHandler(GPIO_PIN_6);
    HAL_GPIO_EXTI_IRQHandler(GPIO_PIN_7);
    HAL_GPIO_EXTI_IRQHandler(GPIO_PIN_8);
    HAL_GPIO_EXTI_IRQHandler(GPIO_PIN_9);
}
void EXTI15_10_IRQHandler(){
    HAL_GPIO_EXTI_IRQHandler(GPIO_PIN_10);
    HAL_GPIO_EXTI_IRQHandler(GPIO_PIN_11);
    HAL_GPIO_EXTI_IRQHandler(GPIO_PIN_12);
    HAL_GPIO_EXTI_IRQHandler(GPIO_PIN_13);
    HAL_GPIO_EXTI_IRQHandler(GPIO_PIN_14);
    HAL_GPIO_EXTI_IRQHandler(GPIO_PIN_15);
}


void USART1_IRQHandler(){
    HAL_UART_IRQHandler(&uart_objs_[0].handle);
}
#ifdef USART2
void USART2_IRQHandler(){
    HAL_UART_IRQHandler(&uart_objs_[1].handle);
}
#endif
#ifdef USART3
void USART3_IRQHandler(){
    HAL_UART_IRQHandler(&uart_objs_[2].handle);
}
#endif
#ifdef UART4
void UART4_IRQHandler(){
    HAL_UART_IRQHandler(&uart_objs_[3].handle);
}
#endif
#ifdef UART5
void UART5_IRQHandler(){
    HAL_UART_IRQHandler(&uart_objs_[4].handle);
}
#endif



#endif //#ifdef STM32
